src/main/resources/docs/ConsultarNfsePorRps.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><ConsultarNfsePorRps xmlns="https://www.e-governeapps2.com.br/"><?xml version="1.0" encoding="UTF-8" ?><ConsultarNfseRpsEnvio xmlns="http://www.abrasf.org.br/ABRASF/arquivos/nfse.xsd"><IdentificacaoRps><Numero>143865</Numero><Serie>0</Serie><Tipo>0</Tipo></IdentificacaoRps><Prestador><Cnpj>93388031000142</Cnpj><InscricaoMunicipal>10911</InscricaoMunicipal></Prestador></ConsultarNfseRpsEnvio></ConsultarNfsePorRps></soap:Body></soap:Envelope>